Revit 2024 API
BuiltInFailures.ElevationFailures.IncompatibleElevationTagFamily Property
 Attempt to change elevation tag families to one with incompatible view directions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IncompatibleElevationTagFamily { get; }
Visual Basic
Public Shared ReadOnly Property IncompatibleElevationTagFamily As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IncompatibleElevationTagFamily {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElevationFailures Class
Autodesk.Revit.DB Namespace